slides/resources/soapRequest.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:as="http://www.anderscore.com/soap">

    <soap:Header/>

    <soap:Body>
        <as:getCoursesRequest>
            <as:title>Spring</as:title>
        </as:getCoursesRequest>
    </soap:Body>

</soap:Envelope>
